module RulesList
  ( rules,
  )
where

import CommonRules (commonRules)
import RuleUtils (technicalRules, a, d, f, i, m, o, s)
import Rules (RulesMap, (|:), mergeRules, (==>), fromList)

deeperRules :: RulesMap
deeperRules =
  fromList
    [ "дядя" |: o m ==> i a ==> i a,
      "тётя" |: o f ==> i a ==> i a,
      "двоюродный брат/сестра" |: "ребёнок" ==> "сиблинг" ==> "родитель",
      "прадедушка" |: i m ==> "прародитель",
      "прабабушка" |: i f ==> "прародитель",
      "правнук" |: o m ==> "ребенок" ==> "ребенок",
      "правнучка" |: o f ==> "ребенок" ==> "ребенок",
      "прадядя" |: o m ==> i a ==> "прародитель",
      "пратётя" |: o f ==> i a ==> "прародитель",
      "племянник" |: o m ==> "сиблинг",
      "племянница" |: o f ==> "сиблинг",
      "бывшая жена мужа (надеюсь)" |: i f ==> o a ==> d m,
      "бывший муж жены (надеюсь)" |: i m ==> o a ==> d f,
      "жена брата супруга" |: d f ==> "сиблинг" ==> s,
      "муж сестры супруга" |: d m ==> "сиблинг" ==> s,
      "внучатый племянник" |: o m ==> "ребенок" ==> "ребенок" ==> "сиблинг",
      "внучатая племянница" |: o f ==> "ребенок" ==> "ребенок" ==> "сиблинг",
      "двоюродный на поколение старше" |: "ребёнок" ==> "сиблинг" ==> "прародитель",
      "двоюродный на поколение младше" |: "ребенок" ==> "сиблинг" ==> "ребенок"
    ]


rules :: RulesMap
rules = commonRules `mergeRules` deeperRules `mergeRules` technicalRules
