module RulesList
  ( rules,
  )
where

import CommonRules (commonRules)
import RuleUtils (technicalRules, a, d, f, i, m, o, s)
import Rules (RulesMap, (|:), mergeRules, (==>), fromList)

deeperRules :: RulesMap
deeperRules =
  fromList
    [ "брат" ==> "родитель"                         |: "дядя",
      "сестра" ==> "родитель"                       |: "тетя",
      o m ==> "сиблинг" ==> "родитель"              |: "двоюродный брат",
      o f ==> "сиблинг" ==> "родитель"              |: "двоюродный сестра",
      i m ==> "прародитель"                         |: "прадедушка",
      i f ==> "прародитель"                         |: "прабабушка",
      o m ==> "ребенок" ==> "ребенок"               |: "правнук",
      o f ==> "ребенок" ==> "ребенок"               |: "правнучка",
      o m ==> i a ==> "прародитель"                 |: "прадядя",
      o f ==> i a ==> "прародитель"                 |: "пратетя",
      o m ==> "сиблинг"                             |: "племянник",
      o f ==> "сиблинг"                             |: "племянница",
      i f ==> o a ==> d m                           |: "бывшая жена мужа (надеюсь)",
      i m ==> o a ==> d f                           |: "бывший муж жены (надеюсь)",
      d f ==> "сиблинг" ==> s                       |: "жена брата супруга",
      d m ==> "сиблинг" ==> s                       |: "муж сестры супруга",
      o m ==> "ребенок" ==> "ребенок" ==> "сиблинг" |: "внучатый племянник",
      o f ==> "ребенок" ==> "ребенок" ==> "сиблинг" |: "внучатая племянница",
      "ребенок" ==> "сиблинг" ==> "прародитель"     |: "двоюродный на поколение старше",
      "ребенок" ==> "сиблинг" ==> "ребенок"         |: "двоюродный на поколение младше"
    ]

rules :: RulesMap
rules = commonRules `mergeRules` deeperRules `mergeRules` technicalRules
